/* cocoaControlController */

"applicationShouldTerminate:standardAlert" = "Q can't be closed. There are still guest PCs running.";
"applicationShouldTerminate:informativeText" = "First shutdown the guest PCs then quit Q.";

"toolbar:label:newPC" = "New PC";
"toolbar:paletteLabel:newPC" = "New PC";
"toolbar:toolTip:newPC" = "Create new PC";
"toolbar:label:editPC" = "Edit PC";
"toolbar:paletteLabel:editPC" = "Edit PC";
"toolbar:toolTip:editPC" = "Edit PC";
"toolbar:label:removePC" = "Remove PC";
"toolbar:paletteLabel:removePC" = "Remove PC";
"toolbar:toolTip:removePC" = "Remove PC";
"toolbar:label:startPC" = "Start PC";
"toolbar:paletteLabel:startPC" = "Start PC";
"toolbar:toolTip:startPC" = "Start PC";

"editPC:standardAlert" = "The Guest PC \"%@\" can not be edited, because it is in running or saved state.";
"editPC:informativeText" = "First shutdown the Guest PC \"%@\" then edit it.";

"deletePC:standardAlert" = "The Guest PC \"%@\" can not be deleted, because it is running.";
"deletePC:informativeText" = "First shutdown the Guest PC \"%@\" then delete it.";
"deletePC:alertWithMessageText" = "Deleting PC";
"deletePC:defaultButton" = "OK";
"deletePC:alternateButton" = "Cancel";
"deletePC:informativeTextWithFormat" = "Are you sure you want to delete the PC \"%@\"? The PC will be removed permanently from your harddrive.";

"importVPC7PC:progress:title" = "VPC7 import";
"importVPC7PC:progress:config" = "Processing VPC7 configuration";
"importVPC7PC:progress:hdx" = "Converting Harddisk_%D.vhd";
"importVPC7PC:standardAlert:imageConvert" = "Conversion of VPC7 Diskimage failed";
"importVPC7PC:informativeText:imageConvert" = "This kind of VPC Diskimage is not supported by Q.";
"importVPC7PC:standardAlert:plist" = "Import of VPC7 Guest failed";
"importVPC7PC:informativeText:plist" = "Can't read Configuration.plist!\n";
"importVPC7PC:standardAlert:running" = "Import of VPC7 Guest failed";
"importVPC7PC:informativeText:running" = "PC is running! It must be shut down before it can be converted.";
"importVPC7PC:standardAlert:finish" = "Import of VPC guest succeeded";
"importVPC7PC:informativeText:finish" = "Please check the guest prior to start it (for missing CD-Roms etc).";

"importQemuXPCs:progress:title" = "QemuX import";
"importQemuXPCs:progress:config" = "Processing QemuX configuration";
"importQemuXPCs:progress:pc" = "Converting PC \"%@\"...";
"importQemuXPCs:progress:hdx" = "Copying Harddisk %@";
"importQemuXPCs:standardAlert:plist" = "Import of QemuX Guests failed";
"importQemuXPCs:informativeText:plist" = "Can't read oslist.plist!";
"importQemuXPCs:standardAlert:finish" = "Import of QemuX PC's succeeded";
"importQemuXPCs:informativeText:finish" = "Please check the guests prior to start them (for missing CD-Roms etc).";

"exportPCToFlashDrive:savePanel:title" = "Export";
"exportPCToFlashDrive:savePanel:prompt" = "Export";
"exportPCToFlashDrive:progressPanel:title" = "Status";
"exportPCToFlashDrive:progressPanel:text" = "Export";
"exportPCToFlashDrive:progressPanel:statusText1" = "Exporting..";
"exportPCToFlashDrive:progressPanel:statusText2" = "Copying binary..";
"exportPCToFlashDrive:progressPanel:statusText3" = "Copying Guest PC..";
"exportPCToFlashDrive:progressPanel:statusText4" = "Writing Guest PC configuration..";
"exportPCToFlashDrive:progressPanel:statusText5" = "Copying additional Guest PC disk images..";
"exportPCToFlashDrive:progressPanel:statusText6" = "Finishing Guest PC configuration..";
"exportPCToFlashDrive:alert:writeToFile:messageText" = "Error writing configuration";
"exportPCToFlashDrive:alert:writeToFile:informativeText" = "The configuration file could not be written.";
"exportPCToFlashDrive:alert:exportFinished:messageText" = "Export finished";
"exportPCToFlashDrive:alert:exportFinished:informativeText" = "Export of the Guest PC %@ is complete. You can now use it as a standalone application on any PowerPC or Intel Mac.";

"exportThisPCToFlashDrive:standardAlert" = "The Guest PC \"%@\" can not be exported to a Flash Drive, because it is in running or saved state.";
"exportThisPCToFlashDrive:informativeText" = "First shutdown the Guest PC \"%@\" then export it.";

"exportThisPCToFlashDrive:alertWithMessageText" = "Exporting the Guest PC \"%@\"";
"exportThisPCToFlashDrive:defaultButton" = "OK";
"exportThisPCToFlashDrive:alternateButton" = "Cancel";
"exportThisPCToFlashDrive:informativeTextWithFormat" = "The Guest PC will now be exported to run in standalone mode. This means you can take it with you on an external storage (for example on an USB Flash Drive), plug it into any Mac and run your Guest PC out of the box.\n\nPlease note that saving/loading a Guest PC state is not available in standalone mode. This does not affect your Guest PC configuration in Q.";

"importPCFromFlashDrive:alert:notFound:messageText" = "Could not find Guest PC";
"importPCFromFlashDrive:alert:notFound:informativeText" = "The file seems to be an ordinary application.";
"importPCFromFlashDrive:progressPanel:title" = "Status";
"importPCFromFlashDrive:progressPanel:text" = "Import";
"importPCFromFlashDrive:progressPanel:statusText1" = "Copying Guest PC..";
"importPCFromFlashDrive:alert:importFinished:messageText" = "Import finished";
"importPCFromFlashDrive:alert:importFinished:informativeText" = "Import of the Guest PC %@ is complete. You can now run it in Q.";


"addArgumentTo:standardAlert" = "Can't start guest PC";
"addArgumentTo:informativeText" = "This configuration uses pre 0.8.0 Syntax (%@). Please remove it from the advanced tab.";

"URLResourceDidFinishLoading:alertWithMessageText" = "There is a new Version of Q available. Do You want to download it now?";
"URLResourceDidFinishLoading:defaultButton" = "OK";
"URLResourceDidFinishLoading:alternateButton" = "Cancel";

"tableView:audio" = "Audio: %@\n";
"tableView:mb" = "%@, %@mb\n";


/* vmstate */

"running" = "running";
"saved" = "saved";
"shutdown" = "shutdown";


/* cocoaControlDiskImage */

"dIWindowCreate:file" = "My new Diskimage.%@";

"savePanelDidEnd:dIName" = "Diskimage: %@";


/* cocoaControlEditPC */

"prepareEditPCPanel:newPC" = "Create PC";
"prepareEditPCPanel:updatePC" = "Update PC";

"toolbar:label:general" = "General";
"toolbar:paletteLabel:general" = "General";
"toolbar:toolTip:general" = "General";
"toolbar:label:hardware" = "Hardware";
"toolbar:paletteLabel:hardware" = "Hardware";
"toolbar:toolTip:hardware" = "Hardware";
"toolbar:label:advanced" = "Advanced";
"toolbar:paletteLabel:advanced" = "Advanced";
"toolbar:toolTip:advanced" = "Advanced";
"toolbar:label:network" = "Network";
"toolbar:paletteLabel:network" = "Network";
"toolbar:toolTip:network" = "Network";

"viewGeneral:title" = "Q %@ - General";

"viewHardware:title" = "Q %@ - Hardware";

"viewAdvanced:title" = "Q %@ - Advanced";

"viewNetwork:title" = "Q %@ - Network";

"setCustomDIType:title" = "Custom Image";

"editPCEditPCPanel:name" = "choose a Name";
"editPCEditPCPanel:charName" = "Name with illegal characters (:./)";
"editPCEditPCPanel:otherName" = "choose other Name";

"initFirewallSettings:popUpButtonFirewallAdittionalPortsCustom" = "Custom..";

"startShowEditPort:restrictedPorts1" = "%@,%@ on the Host to port(s) %@,%@ on the Guest (TCP and UDP).";
"startShowEditPort:restrictedPorts2" = "%@ on the Host to port(s) %@ on the Guest (TCP).";
"startShowEditPort:restrictedPorts2" = "%@ on the Host to port(s) %@ on the Guest (UDP).";
"startShowEditPort:AlertSheet:messageText" = "This service cannot be edited";
"startShowEditPort:AlertSheet:defaultButton" = "OK";
"startShowEditPort:AlertSheet:informativeText" = "%@ redirects incoming connections from port(s) %@";

"startEditPort:popUpButtonFirewallAdittionalPortsCustom" = "Custom..";

"deletePort:AlertSheet:messageText" = "This service cannot be deleted!";
"deletePort:AlertSheet:defaultButton" = "OK";
"deletePort:AlertSheet:informativeText" = "To disable this service from being redirected use the corresponding checkbox.";

"checkPort:textFieldFirewallPortError:name" = "No empty name!";
"checkPort:textFieldFirewallPortError:hostport" = "No empty host-port entry!";
"checkPort:textFieldFirewallPortError:guestport" = "No empty guest-port entry!";
"checkPort:textFieldFirewallPortError:illegalchars" = "Illegal characters in ports!";
"checkPort:textFieldFirewallPortError:combination" = "Combination of , and - not allowed.";


/* cocoaControlPreferences */

"toolbar:label:general" = "General";
"toolbar:paletteLabel:general" = "General";
"toolbar:toolTip:general" = "General";

"viewGeneral:title" = "General";

/* cocoaDownload */

"startBTDownload:torrentFile:length" = "Could not download bittorrent meta file. Maybe the file doesn't exist anymore or the server is down.";
"startBTDownload:torrentFile:tError:invalid" = "Bittorrent: Invalid torrent / bad torrent file.";
"startBTDownload:torrentFile:tError:unsupported" = "Bittorrent: Unsupported torrent file.";
"startBTDownload:torrentFile:tError:exists" = "Bittorrent: Torrent already exists.";
"startBTDownload:torrentFile:tError:miscellanious" = "Bittorrent: Miscellanious error.";

"checkDownloadStarted:errorDescription" = "Could not connect to the server. Connection timed out after 60 seconds.";

/* cocoaDownloadController */

"showAllDownloads:AlertSheet:standardAlert" = "Cannot show Guest PCs from free.oszoo.org.";
"showAllDownloads:AlertSheet:defaultButton" = "OK";
"showAllDownloads:AlertSheet:informativeText" = "Couldn't get the list of downloadable Guest PCs from kju-app.org.";

"tableView:objectValueForTableColumn:Size" = "Download Size";
"tableView:objectValueForTableColumn:Author" = "provided by";

"showDetails:MoreInfo" = "More Info";
"startDownload:downloadButton:Title" = "Stop";
"startDownload:statusText:Text" = "Starting download...";

"stopDownload:AlertSheet:standardAlert" = "You have active downloads running";
"stopDownload:AlertSheet:defaultButton" = "Stop";
"stopDownload:AlertSheet:alternativeButton" = "Cancel";
"stopDownload:AlertSheet:informativeText" = "Are you sure you want to stop downloading?";

"downloadDidReceiveData:remainingString1" = "%d hours %d minutes remaining";
"downloadDidReceiveData:remainingString2" = "%d minutes %d seconds remaining";
"downloadDidReceiveData:remainingString3" = "about %d minutes remaining";
"downloadDidReceiveData:remainingString4" = "about %d seconds remaining";
"downloadDidReceiveData:connecting" = "Connecting..";
"downloadDidReceiveData:statusText1" = "%.0f %@ of %.1f %@ (%d kB/s), %@";
"downloadDidReceiveData:statusText2" = "%.1f %@ of %.1f %@ (%d kB/s), %@";

"downloadDidFinish:statusText" = "Download finished.";
"downloadDidFail:statusText" = "Download failed.";
"downloadDidFail:AlertSheet:standardAlert" = "Download failed";
"downloadDidFail:AlertSheet:defaultButton" = "OK";

"uncompressPC:statusText" = "Extracting files..";

"finishDownload:statusText1" = "Importing Free OS..";
"finishDownload:message1" = "You can now start using your Free OS.";
"finishDownload:message2" = "The harddisk could not be found. Please check the settings before using your Free OS.";
"finishDownload:message3" = "The files could not be extracted. The archive seems to be corrupt. You may want to try to extract it manually or report this to free.oszoo.org.\n\nPath: %@";
"finishDownload:message4" = "The files could not be extracted. The downloaded file seems to be no archive.\n\nPath: %@";
"finishDownload:AlertSheet:messageText" = "Import finished";
"finishDownload:AlertSheet:defaultButton" = "OK";
"finishDownload:statusText2" = "Finished.";
